{
  "global": {
    "name": "Student Name",
    "grade": "Grade 9",
    "school": "School Name",
    "email": "student@school.ca",
    "phone": "(000) 000-0000",
    "course": "BEM1O"
  },
  "home": {
    "badge": "BEM1O | Intro to Business and Technology",
    "kicker": "Hi there, I'm Student Name",
    "heroTitleLead": "I build",
    "heroTitleAccents": [
      "useful",
      "creative",
      "reliable",
      "thoughtful"
    ],
    "heroTitleTail": "projects",
    "welcome": "I am a student interested in technology and computer science. I work on websites and digital projects and enjoy learning how systems work and improve over time. This portfolio tracks my learning, problem-solving, and growth throughout the course.",
    "primaryButton": "See My Work",
    "secondaryButton": "About Me",
    "meta": [
      "Tech Focused",
      "Web Development",
      "Problem Solving"
    ],
    "highlightsTitle": "Tech-Inspired Highlights",
    "highlightsSubtitle": "A simple overview of the skills and interests that shape my work in BEM1O.",
    "highlightCards": [
      {
        "title": "Clean Design",
        "text": "I use grids, spacing, and clear typography to keep content organized and easy to read."
      },
      {
        "title": "Creative Problem-Solving",
        "text": "Each project is a chance to test ideas, debug issues, and learn better ways to build."
      },
      {
        "title": "Growing Skills",
        "text": "I track progress with reflections and updates so the portfolio shows improvement over time."
      }
    ],
    "photoLabel": "Photo of Student Name",
    "photoCaption": "Placeholder image (replace with your photo)."
  },
  "about": {
    "title": "Curious About How Tech Works",
    "intro": "I am interested in technology and computer science because I like seeing how digital systems are designed and improved. Building websites and digital projects helps me combine creativity with logic, and I enjoy exploring how small changes can make systems more efficient and user friendly.",
    "focus": "I am learning to connect ideas, test solutions, and communicate my thinking clearly. This page shows my interests, goals, and milestones.",
    "interests": [
      "Computers",
      "Programming",
      "Web development",
      "Problem-solving"
    ],
    "favourites": [
      "Book: [Title]",
      "Show: [Title]",
      "Game: [Title]",
      "Movie: [Title]"
    ],
    "accomplishments": [
      "Certificate: [Name]",
      "Certificate: [Name]",
      "Achievement: [Name]"
    ],
    "goals": [
      "Course: [BEM1O goal]",
      "Career: [Technology/CS goal]",
      "Personal: [Growth goal]"
    ],
    "contact": [
      "Email: student@school.ca",
      "Phone: (000) 000-0000"
    ],
    "focusNote": "[Short note about what you are practicing right now.]"
  },
  "portfolio": {
    "title": "My Work in BEM1O",
    "intro": "This section holds assignments, unit projects, and digital builds. Each project includes a short summary and a reflection on problem-solving and learning.",
    "yearPlan": "I will add new assignments as they are completed, including group work or presentations. This page shows how my skills grow across the course.",
    "units": [
      {
        "title": "Unit 1: Digital Foundations",
        "subtitle": "Introductory projects focused on understanding digital tools.",
        "projects": [
          {
            "title": "Assignment 1: My First Web Page",
            "description": "Built a simple HTML page with headings, lists, and images to learn the structure of a website.",
            "reflection": "I learned how to organize content and fix layout mistakes."
          },
          {
            "title": "Assignment 2: Research Summary",
            "description": "Created a one-page report on a technology topic using clean formatting and clear sections.",
            "reflection": "I practiced summarizing information and using evidence."
          },
          {
            "title": "Placeholder: Upcoming Project",
            "description": "Description will be added after the assignment is completed.",
            "reflection": "Learning and troubleshooting notes go here."
          }
        ]
      },
      {
        "title": "Unit 2: Web Design + Problem Solving",
        "subtitle": "Projects that develop layout, style, and user-focused design.",
        "projects": [
          {
            "title": "Assignment 3: Multi-Page Website",
            "description": "Designed a multi-page site with navigation and consistent styling to practice organization and user flow.",
            "reflection": "I improved my ability to plan pages and connect them."
          },
          {
            "title": "Group Project: Digital Presentation",
            "description": "Collaborated on a presentation about digital trends and shared feedback with teammates.",
            "reflection": "I practiced teamwork and clear communication."
          },
          {
            "title": "Placeholder: Future Build",
            "description": "Details will be added when this project is complete.",
            "reflection": "Note the most challenging parts and how I solved them."
          }
        ]
      },
      {
        "title": "Unit 3: Systems + Innovation",
        "subtitle": "Exploring how systems connect and improve over time.",
        "projects": [
          {
            "title": "Placeholder: Systems Investigation",
            "description": "A research or build project about how a system works and how it can be improved.",
            "reflection": "Focus on logic, creativity, and troubleshooting."
          },
          {
            "title": "Placeholder: Capstone Project",
            "description": "A final project that combines web skills, research, and creative problem-solving.",
            "reflection": "Summarize the biggest learning moments."
          }
        ]
      }
    ]
  },
  "reflection": {
    "title": "Learning Log",
    "intro": "Reflection helps me track growth, notice patterns, and improve how I solve problems. I add a new entry after major assignments or units.",
    "skills": "Teamwork, communication, technical thinking, and problem-solving are core skills in BEM1O. I look for evidence of progress in each reflection.",
    "subtitle": "Use this layout after major milestones. Copy and update the template for each new assignment.",
    "entries": [
      {
        "title": "Entry 1: Multi-Page Website",
        "learned": "I learned how to keep navigation consistent and how CSS can create a clean visual system.",
        "wentWell": "Planning the layout first made the build process smoother.",
        "challenging": "Debugging spacing issues took time, but I solved it by testing one section at a time."
      },
      {
        "title": "Entry 2: Research Summary",
        "learned": "I practiced turning complex information into clear points.",
        "wentWell": "Organizing sources and staying focused helped me finish early.",
        "challenging": "I had to revise my draft to keep it short and readable."
      },
      {
        "title": "Entry 3: Placeholder for Future Reflection",
        "learned": "[Add notes about new skills or ideas.]",
        "wentWell": "[Add what worked or improved.]",
        "challenging": "[Add the biggest obstacle and how you solved it.]"
      }
    ]
  }
}
